Repository: BozoDel/LoveKnowsNoBorders-PT
Catalog: lovePT-level2.tmx
Source language: en_us
Languages: pt_br

source: Creates and draws a textured circle with a red tint at the center.
pt_br: Cria e desenha um círculo texturizado com o centro avermelhado.

source: mesh = love.graphics.newMesh( vertices, texture, mode )
pt_br: malha = love.graphics.newMesh( vertices, textura, modo )

source: Angles must be given in radians for rotation.
pt_br: Para a rotação, ângulos devem ser dados em radianos.

source: love.graphics.setDefaultImageFilter( min, mag )
pt_br: love.graphics.setDefaultImageFilter( red, amp)

source: wireframe
pt_br: estDeArame

source: The path to a potential directory.
pt_br: O caminho de um possível diretório.

source: Do not use this function in [[love.update]] or [[love.draw]]. That would create a new font every frame, eating up memory very quickly.
pt_br: Não use esta função dentro de [[love.update (Português)|love.update]] ou [[love.draw (Português)|love.draw]]. Isso criaria uma nova fonte a cada frame, consumindo a memória rapidamente.

source: is_dir = love.filesystem.isDirectory( filename )
pt_br: eh_dir = love.filesystem.isDirectory( nomeDoArquivo )

source: Framebuffers are susceptible to [http://love2d.org/wiki/PO2_Syndrome power of 2 syndrome].
pt_br: Framebuffers são suscetíveis à [http://love2d.org/wiki/PO2_Syndrome_(Português) síndrome da potência de 2].

source: Function that draws the stencil.
pt_br: Função de que desenha o estêncil.

source: Sets the [[love.graphics.setPoint|point]] size.
pt_br: Configura o tamanho de [[love.graphics.setPoint (Português)|ponto]].

source: height (window_height)
pt_br: altura (altura_da_janela)

source: TextureFormat
pt_br: FormatoDeTextura

source: The current line width.
pt_br: A espessura de linha atual.

source: The scissor limits the drawing area to a specified rectangle.
pt_br: O recorte limita a área de desenho a um retângulo especificado.

source: If a game is in fused mode, its save directory will be directly in the Appdata directory instead of Appdata/LOVE/.
pt_br: Se um jogo estiver em modo fundido, seu diretório de escrita será diretamente no diretório Appdata (Dados de Aplicativo), em vez de em Appdata/LOVE/.

source: The current point style.
pt_br: O estilo de ponto atual.

source: The LineJoin to use.
pt_br: A JunçãoDeLinha a ser usada.

source: Removes a file or empty directory.
pt_br: Remove um diretório vazio ou arquivo.

source: love.graphics.setColor(255, 0, 0) love.graphics.circle(50, 50, 20, 20) love.graphics.setColor(0, 0, 255) love.graphics.circle(50, 100, 20, 20) myColor = {0, 255, 0, 255} love.graphics.setColor(myColor) love.graphics.circle(50, 150, 20, 20)
pt_br: love.graphics.setColor(255, 0, 0) love.graphics.circle(50, 50, 20, 20) love.graphics.setColor(0, 0, 255) love.graphics.circle(50, 100, 20, 20) minhaCor = {0, 255, 0, 255} love.graphics.setColor(minhaCor) love.graphics.circle(50, 150, 20, 20)

source: mesh
pt_br: malha

source: Example
pt_br: Exemplo

source: Draw a zigzag line from the a single table.
pt_br: Desenhar uma linha em zigue-zague a partir de uma única tabela.

source: filename
pt_br: nomeDoArquivo

source: The position to draw the object (y-axis).
pt_br: A posição em que o objeto será desenhado (eixo y).

source: Creates a new [[Canvas]].
pt_br: Cria uma nova [[Canvas (Português)|Pintura]].

source: Pixel shader code is run for every pixel on the screen that a drawn object touches, and is used to produce the color that will be blended onto the screen at that pixel, often by reading from an image.
pt_br: O código do shader de pixel roda uma vez para cada pixel na tela que o objeto desenhado toca, e é usado para produzir a cor que será misturada na tela naquele pixel, frequentemente lida de uma imagem.

source: The Quad to draw on screen.
pt_br: O Quad a ser desenhado na tela.

source: * [[love.graphics.getFont]]
pt_br: * [[love.graphics.getFont (Português)|love.graphics.getFont]]

source: Draws a filled or unfilled arc at position (x, y) .
pt_br: Desenha um arco preenchido ou não preenchido na posição (x, y) .

source: Event
pt_br: Evento

source: Returns the velocity of the listener.
pt_br: Retorna a velocidade do ouvinte.

source: sometable = { 100, 100, 200, 200, 300, 100, 400, 200, } function love.draw() love.graphics.line(sometable) end
pt_br: umatabela = { 100, 100, 200, 200, 300, 100, 400, 200, } function love.draw() love.graphics.line(umatabela) end

source: Iterator function usable in a for loop.
pt_br: Função iteradora que pode ser usada num laço for.

source: We use [[love.graphics.pop]] to return to normal render scale, after having used [[love.graphics.push]].
pt_br: Usamos [[love.graphics.pop (Português)|love.graphics.pop]] para retornar à escala de renderização normal, após ter usado [[love.graphics.push (Português)|love.graphics.push]].

source: text
pt_br: texto

source: Returns the current target Canvas.
pt_br: Retorna a Pintura alvo atual.

source: source = love.audio.newSource( decoder, type )
pt_br: fonte = love.audio.newSource( decodificador, tipo )

source: Fourth event argument.
pt_br: Quarto argumento do evento.

source: Filter mode used when scaling the image up.
pt_br: Modo de filtragem usado ao ampliar a imagem.

source: Quitting a game in 0.7.2
pt_br: Saindo de um jogo no 0.7.2

source: LÖVE's coordinate system is rooted in the upper-left corner of the screen, which is at location (0, 0).
pt_br: O sistema de coordenadas do LÖVE está ancorado no canto superior esquerdo da tela, localizado em (0, 0).

source: * [[love.filesystem.isDirectory]]
pt_br: * [[love.filesystem.isDirectory (Português)|love.filesystem.isDirectory]]

source: The full list can be found here: [[Shader Variables]].
pt_br: A lista completa pode ser encontrada aqui: [[Shader Variables (Português)|Variáveis de Shader]].

source: * [[love.graphics.setLineJoin]]
pt_br: * [[love.graphics.setLineJoin (Português)|love.graphics.setLineJoin]]

source: font = love.graphics.newImageFont( data, glyphs )
pt_br: fonte = love.graphics.newImageFont( dado, glifos )

source: This variant uses the default font (Vera Sans) with a custom size.
pt_br: Esta variante usa a fonte padrão (Vera Sans) com um tamanho personalizado.

source: * [[love.graphics.getPointStyle]]
pt_br: * [[love.graphics.getPointStyle (Português)|love.graphics.getPointStyle]]

source: The folder or zip file in the game's save directory to mount.
pt_br: A pasta ou arquivo zip no diretório de escrita do jogo, para ser montado(a).

source: x, y, width, height = love.graphics.getScissor( )
pt_br: x, y, largura, altura = love.graphics.getScissor( )

source: This function is not supported in that and later versions
pt_br: Esta função não é suportada nessa versão e posteriores

source: MeshDrawMode
pt_br: ModoDeDesenhoDeMalha

source: Sets or resets a [[PixelEffect]] as the current pixel effect.
pt_br: Configura ou desconfigura um [[PixelEffect (Português)|EfeitoDePixel]] como o efeito de pixel atual.

source: canvas1
pt_br: pintura1

source: The position of the bottom left corner along x-axis.
pt_br: A posição do canto inferior esquerdo no eixo x.

source: Many of the functions are used to manipulate the graphics coordinate system , which is essentially the way coordinates are mapped to the display.
pt_br: Muitas das funções são usadas para manipular o sistema de coordenadas gráficas , que é essencialmente a maneira como coordenadas são mapeadas na tela.

source: * [[love.graphics.setInvertedStencil]]
pt_br: * [[love.graphics.setInvertedStencil (Português)|love.graphics.setInvertedStencil]]

source: align ("left")
pt_br: alinhamento ("left")

source: love.graphics.setInvertedStencil( stencilFunction )
pt_br: love.graphics.setInvertedStencil( funcaoEstencil )

source: The position of first point on the x-axis.
pt_br: A posição do primeiro ponto no eixo x.

source: ok = love.filesystem.mkdir( name )
pt_br: ok = love.filesystem.mkdir( nome )

source: It has been renamed to [[love.filesystem.getDirectoryItems]]
pt_br: Foi renomeado para [[love.filesystem.getDirectoryItems (Português)|love.filesystem.getDirectoryItems]]

source: Sets the render target to multiple simultaneous [[Canvas]]es.
pt_br: Configura [[Canvas (Português|Pinturas]] múltiplas como alvo de renderização simultânea.

source: -- Yes: love.filesystem.setIdentity("monkey_doom_2") -- No: -- love.filesystem.setIdentity("c:/Users/bob/monkey_doom_2")
pt_br: -- Correto: love.filesystem.setIdentity("monkey_doom_2") -- Errado: -- love.filesystem.setIdentity("c:/Users/bob/monkey_doom_2")

source: Creates a new [[SpriteBatch]] object.
pt_br: Cria um novo objeto [[SpriteBatch (Português)|LoteDeSprites]].

source: * [[ Image]]
pt_br: * [[ Image (Português)|Imagem]]

source: Height of the rectangle.
pt_br: A altura do retângulo.

source: mountpoint
pt_br: pontoDeMontagem

source: glyphData
pt_br: dadoDeGlifo

source: function love.load() baseX = 300 baseY = 400 radius = 100 offsetY = radius*.5*math.sqrt(3) love.graphics.setBackgroundColor(255,255,255) end function love.draw() love.graphics.setColor(255, 0, 0, 100) love.graphics.circle('fill', baseX, baseY, radius, 50) love.graphics.setColor(0, 255, 0, 100) love.graphics.circle('fill', baseX + radius / 2, baseY - offsetY, radius, 50) love.graphics.setColor(0, 0, 255, 100) love.graphics.circle('fill', baseX + radius, baseY, radius, 50) end
pt_br: function love.load() baseX = 300 baseY = 400 raio = 100 deslocamentoY = raio*.5*math.sqrt(3) love.graphics.setBackgroundColor(255,255,255) end function love.draw() love.graphics.setColor(255, 0, 0, 100) love.graphics.circle('fill', baseX, baseY, raio, 50) love.graphics.setColor(0, 255, 0, 100) love.graphics.circle('fill', baseX + raio / 2, baseY - deslocamentoY, raio, 50) love.graphics.setColor(0, 0, 255, 100) love.graphics.circle('fill', baseX + raio, baseY, raio, 50) end

source: myStencil
pt_br: meuEstencil

source: pe
pt_br: edp

source: Sets the current shader to a specified [[Shader]].
pt_br: Configura o [[Shader (Português)|Shader]] especificado como o shader atual.

source: * [[love.event.poll]]
pt_br: * [[love.event.poll (Português)|love.event.poll]]

source: All drawing operations until the next love.graphics.setCanvas call will be redirected to the [[Canvas]] and not shown on the screen.
pt_br: Todas operações de desenho até a próxima chamada de love.graphics.setCanvas serão redirecionadas à [[Canvas (Português)|Pintura]] e não serão mostradas na tela.

source: SpriteBatch
pt_br: LoteDeSprites

source: Whether to include the screen's alpha channel in the ImageData. If false, the screenshot will be fully opaque.
pt_br: Se se deve incluir ou não o canal alfa da tela no DadoDeImagem. Se falso, a captura será totalmente opaca.

source: Returns the position of the listener.
pt_br: Retorna a posição do ouvinte.

source: After scaling by sx and sy, all coordinates are treated as if they were multiplied by sx and sy.
pt_br: Depois de alterar a escala em ex e ey, tratam-se todas as coordenadas como se fossem multiplicadas por ex e ey.

source: sw
pt_br: ls

source: Pixel shader code is executed after all the object's vertices have been processed by the vertex shader.
pt_br: O código do shader de pixel é executado depois que todos os vértices do objeto tenham sido processados pelo shader de vértice.

source: * [[love.graphics.setScissor]]
pt_br: * [[love.graphics.setScissor (Português)|love.graphics.setScissor]]

source: function love.load() local pixelcode = [[ vec4 effect( vec4 color, Image texture, vec2 texture_coords, vec2 screen_coords ) { vec4 texcolor = Texel(texture, texture_coords); return texcolor * color; } ]] local vertexcode = [[ vec4 position( mat4 transform_projection, vec4 vertex_position ) { return transform_projection * vertex_position; } ]] shader = love.graphics.newShader(pixelcode, vertexcode) end function love.draw() love.graphics.setShader(shader) -- draw things love.graphics.setShader() -- draw more things end
pt_br: function love.load() local codigodepixel = [[ vec4 effect( vec4 color, Image texture, vec2 texture_coords, vec2 screen_coords ) { vec4 texcolor = Texel(texture, texture_coords); return texcolor * color; } ]] local codigodevertice = [[ vec4 position( mat4 transform_projection, vec4 vertex_position ) { return transform_projection * vertex_position; } ]] shader = love.graphics.newShader(codigodepixel, codigodevertice) end function love.draw() love.graphics.setShader(shader) -- desenhar coisas love.graphics.setShader() -- desenhar mais coisas end

source: * [[Canvas:renderTo]]
pt_br: * [[Canvas:renderTo (Português)|Pintura:renderTo]]

source: Using the repeat will stretch the pattern and multiplies each 1 and 0.
pt_br: Usar a repeticao irá esticar o padrão e multiplicar cada 1 e 0.

source: Gets the current [[Shader]].
pt_br: Obtém o [[Shader (Português)|Shader]] atual.

source: The green component (0-255).
pt_br: A componente verde (0-255).

source: The directory to create.
pt_br: O diretório a ser criado.

source: The amount to rotate the coordinate system in radians.
pt_br: O tanto que se deve rotacionar o sistema de coordenadas, em radianos.

source: width = love.graphics.getLineWidth( )
pt_br: espessura = love.graphics.getLineWidth( )

source: Decoder
pt_br: Decodificador

source: * [[Framebuffer:renderTo]]
pt_br: * [[Framebuffer:renderTo (Português)|Framebuffer:renderTo]]

source: The y position of the listener.
pt_br: A posição em y do ouvinte.

source: -- Assuming content.zip exists in the game's save directory and contains a file called 'myimage.png'. love.filesystem.mount("content.zip", "content") assert(love.filesystem.exists("content/myimage.png"))
pt_br: -- Supondo que conteúdo.zip exista no diretório de escrita do jogo e contenha um arquivo chamado "minhaimagem.png". love.filesystem.mount("conteúdo.zip", "conteúdo") assert(love.filesystem.exists("conteúdo/minhaimagem.png"))

source: The filepath to the font file.
pt_br: O caminho até o arquivo da fonte.

source: ParticleSystem
pt_br: SistemaDePartículas

source: mode ("fan")
pt_br: modo ("fan")

source: How to draw the arc.
pt_br: Como desenhar o arco

source: The size in bytes of the file, or nil on failure.
pt_br: O tamanho do arquivo em bytes, ou nil no caso de falha.

source: The position of the bottom right corner along y-axis.
pt_br: A posição do canto inferior direito no eixo y.

source: kx (0)
pt_br: ix (0)

source: The y-component of the top-left point of the box.
pt_br: O componente y do ponto superior esquerdo da área.

source: The blue color component.
pt_br: O componente de cor azul.

source: Sets the source of the game, where the code is present.
pt_br: Configura a fonte do jogo, onde o código está.

source: imageData
pt_br: dadoDeImagem

source: Sets the default scaling filters used with [[Image]]s, [[Canvas]]es, and [[Font]]s.
pt_br: Configura os filtros de redimensionamento padrão usados com [[Image (Português)|Imagens]], [[Canvas (Português)|Pinturas]] e [[Font (Português)|Fontes]].

source: enable
pt_br: ativar

source: source = love.audio.newSource( filename, type )
pt_br: fonte = love.audio.newSource( nomeDoArquivo, tipo )

source: * [[love.graphics.setLine]]
pt_br: * [[love.graphics.setLine (Português)|love.graphics.setLine]]

source: You can continue passing point positions to draw a polyline.
pt_br: Você pode continuar passando posições de pontos para desenhar uma cadeia poligonal.

source: A [[Data]] with the font.
pt_br: Um [[Data (Português)|Dado]] contendo a fonte.

source: The X position of the listener.
pt_br: A posição em X do ouvinte.

source: Almost everything returned by this function is highly dependent on the system running the code and should probably not be used to make run-time decisions.
pt_br: Quase tudo retornado por esta função é altamente dependente do sistema que está rodando o código, e provavelmente não deve ser usado para decisões automáticas.

source: The LineStyle to use. Line styles include smooth and rough .
pt_br: O EstiloDeLinha a ser usado. Estilos de linha incluem smooth (suave) e rough (grosseiro).

source: A lame example
pt_br: Um exemplo tosco

source: Note: All paths are relative to the .love archive and save directory.
pt_br: Nota: Todos os caminhos são relativos ao arquivo .love e ao diretório de escrita.

source: Setting a position only works for mono sources.
pt_br: Configurar uma posição só funciona para fontes mono.

source: It has been renamed from [[love.graphics.getPixelEffect]]
pt_br: Foi renomeado, antes era [[love.graphics.getPixelEffect (Português)|love.graphics.getPixelEffect]]

source: function love.load() image = love.graphics.newImage("hamster.png") quad = love.graphics.newQuad(0, 0, 128, 64, image:getWidth(), image:getHeight()) end function love.draw() love.graphics.draw(image, quad, 100, 100) end
pt_br: function love.load() imagem = love.graphics.newImage("hamster.png") quad = love.graphics.newQuad(0, 0, 128, 64, imagem:getWidth(), imagem:getHeight()) end function love.draw() love.graphics.draw(imagem, quad, 100, 100) end

source: love.filesystem.setSource( path )
pt_br: love.filesystem.setSource( caminho )

source: The current blend mode.
pt_br: O modo de mistura atual.

source: True if the game is in fused mode, false otherwise.
pt_br: Verdadeiro se o jogo estiver em modo fundido, senão, falso.

source: Wrapping is implemented by breaking up words by spaces and putting them back together to make sure things fit nicely within the limit provided. However, due to the way this is done, extra spaces between words will end up missing when printed on the screen, and some lines can overflow past the limit you provide!
pt_br: A quebra de linha é implementada separando as palavras pelos espaços e juntando-as novamente para garantir que as coisas caibam no limite definido. Entretanto, devido à maneira como isso é feito, epaços extra entre palavras vão acabar desaparecendo ao ser impressos na tela, e algumas linhas podem transbordar além do limite definido!

source: The drawing color set with [[love.graphics.setColor]].
pt_br: A cor de desenho definida com [[love.graphics.setColor (Português)|love.graphics.setColor]].

source: * [[love.graphics.getLineJoin]]
pt_br: * [[love.graphics.getLineJoin (Português)|love.graphics.getLineJoin]]

source: * [[love.graphics.draw]]
pt_br: * [[love.graphics.draw (Português)|love.graphics.draw]]

source: Note that this does need to be called for any OS to think you're still running,
pt_br: Repare que ela precisa ser chamada para o sistema operacional saber que o programa está rodando,

source: Disables pixel effects, allowing unfiltered drawing operations.
pt_br: Desativa efeitos de pixel, permitindo operações de desenho sem filtro.

source: This variant is not supported in earlier versions
pt_br: Esta variante não é suportada em versões anteriores

source: Files that are opened for write or append will always be created in the save directory.
pt_br: Os arquivos abertos para escrita ou acréscimo sempre serão criados no diretório de escrita.

source: love.graphics.setDefaultFilter( min, mag, anisotropy )
pt_br: love.graphics.setDefaultFilter( red, amp, anisotropia )

source: The absolute path to the save directory.
pt_br: O caminho absoluto do diretório de escrita.

source: The directory.
pt_br: O diretório.

source: love.graphics.polygon( mode, vertices )
pt_br: love.graphics.polygon( modo, vertices )

source: It returns the current transformation state to what it was before the last preceding push.
pt_br: Ela retorna o estado de transformações atual ao que era antes do empilhamento mais recente.

source: * [[love.filesystem.setIdentity]]
pt_br: * [[love.filesystem.setIdentity (Português)|love.filesystem.setIdentity]]

source: success = love.filesystem.mount( archive, mountpoint, appendToPath )
pt_br: sucesso = love.filesystem.mount( arquivo, pontoDeMontagem, acrescentarACaminho )

source: * [[love.graphics.getMaxPointSize]]
pt_br: * [[love.graphics.getMaxPointSize (Português)|love.graphics.getMaxPointSize]]

source: It's recommended that [[Font]] objects are created with [[love.graphics.newFont]] in the loading stage and then passed to this function in the drawing stage.
pt_br: É recomendado criar objetos [[Font (Português)|Fonte]] com [[love.graphics.newFont (Português)|love.graphics.newFont]] no estágio de carregamento e então passá-los a esta função no estágio de desenho.

source: How to draw the polygon.
pt_br: Como o polígono será desenhado.

source: Load Decoder and create a Source
pt_br: Carregar Decodificador e criar uma Fonte

source: * [[love.graphics.setWireframe]]
pt_br: * [[love.graphics.setWireframe (Português)|love.graphics.setWireframe]]

source: True if the operation was successful, or nil if there was an error.
pt_br: Verdadeiro se a operação for um sucesso, ou nil se houver um erro.

source: font = love.graphics.newFont( file, size )
pt_br: fonte = love.graphics.newFont( arquivo, tamanho )

source: Note that the [[love.graphics.setScissor|scissor area]] bounds the cleared region.
pt_br: Note que [[love.graphics.setScissor (Português)|área de recorte]] limita a região a ser limpa.

source: * [[ love]]
pt_br: * [[ love (Português)|love]]

source: pixel shader code
pt_br: código do shader de pixel

source: Use [[love.graphics.isSupported]] to check for support.
pt_br: Use [[love.graphics.isSupported (Português)|love.graphics.isSupported]] para verificar se há suporte.

source: function love.draw() love.graphics.push() -- stores the coordinate system love.graphics.scale(0.5, 0.5) -- reduce everything by 50% in both X and Y coordinates love.graphics.print("Scaled text", 50, 50) -- print half-sized text at 25x25 love.graphics.push() love.graphics.origin() -- Rest the state to the defaults. love.graphics.draw(image, 0, 0) -- Draw the image on screen as if nothing was scaled. love.graphics.pop() -- return to our scaled coordinate state. love.graphics.print("Scaled text", 100, 100) -- print half-sized text at 50x50 love.graphics.pop() -- return to the previous stored coordinated love.graphics.print("Normal text", 50, 50) end
pt_br: function love.draw() love.graphics.push() -- salva o sistema de coordenadas love.graphics.scale(0.5, 0.5) -- reduz tudo em 50% tanto em X como em Y love.graphics.print("Texto redimensionado", 50, 50) -- imprime texto com metade do tamanho em 25x25 love.graphics.push() love.graphics.origin() -- Retorna o estado ao padrão. love.graphics.draw(imagem, 0, 0) -- Desenha a imagem na tela como se nada tivesse sido redimensionado. love.graphics.pop() -- retorna ao nosso estado de coordenadas redimensionado. love.graphics.print("Texto redimensionado", 100, 100) -- imprime texto redimensionado em 50x50 love.graphics.pop() -- retorna às coordenadas salvas anteriormente love.graphics.print("Texto normal", 50, 50) end

source: ok = love.filesystem.createDirectory( name )
pt_br: ok = love.filesystem.createDirectory( nome )

source: It has been renamed from [[love.graphics.getDefaultImageFilter]]
pt_br: Foi renomeado, antes era [[love.graphics.getDefaultImageFilter (Português)|love.graphics.getDefaultImageFilter]]

source: Attempting to create an Image with a width *or* height greater than this number will create a checkerboard-patterned image instead.
pt_br: Tentar criar uma Imagem com largura *ou* altura maior que esse número irá criar uma imagem com um padrão xadrez no lugar dela.

source: The pixel shader or vertex shader code, or a filename pointing to a file with the code.
pt_br: O código do shader de pixel ou de vértice, ou um nome de arquivo apontando para um arquivo com o código.

source: It has been renamed from [[love.graphics.newPixelEffect]]
pt_br: Foi renomeado, antes era [[love.graphics.newPixelEffect (Português)|love.graphics.newPixelEffect]]

source: The position of the vertex on the x-axis.
pt_br: A posição do vértice no eixo x.

source: love.audio.setOrientation( fx, fy, fz, ux, uy, uz )
pt_br: love.audio.setOrientation( dx, dy, dz, sx, sy, sz )
